FV2610/E_0576.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">6.22.2: AD: Bestellung zur Stammdatenänderung an NB (verantwortlich)</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0576</B><BR align="left"/><FONT>Prüfende Rolle: <B>NB</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>10: </B>Stimmen alle Stammdaten für Verwendungszeiträume, welche mit „Im System<BR align="left"/>vorhandene Daten“ gekennzeichnet sind, sowie Verwendungszeiträume welche mit<BR align="left"/>„Im System keine Daten vorhanden“ gekennzeichnet sind, mit dem beim Verantwortlichen vorliegenden Stammdaten überein?<BR align="left"/>Hinweis:<BR align="left"/>Dies ist für jeden in der Anfrage vorhandenen Verwendungszeitraum jeweils für<BR align="left"/>den gesamten Zeitraum zu prüfen.<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>20: </B>Sind in der Bestellung der Stammdatenänderung Verwendungszeiträume der Daten<BR align="left"/>mit dem Code „Erwartete Daten“ und / oder „Keine Daten erwartet“ enthalten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A01" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A01</B><BR align="left"/><BR align="left"/><FONT>Cluster: keine Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein.<BR align="left"/>- Es wurden keine Stammdaten zur Änderung angegeben.<BR align="left"/>Eine Stammdatenänderung wird nicht versendet.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>30: </B>Kommt der Verantwortliche zu dem Ergebnis, dass er Änderungen an seinen<BR align="left"/>Stammdaten vornimmt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A02" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A02</B><BR align="left"/><BR align="left"/><FONT>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein.<BR align="left"/>- Änderungen an den Stammdaten werden vorgenommen.<BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "A03" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A03</B><BR align="left"/><BR align="left"/><FONT>Cluster: keine Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen überein.<BR align="left"/>- Änderungen an den Stammdaten werden nicht vorgenommen.<BR align="left"/>Eine Stammdatenänderung wird nicht versendet.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>40: </B>Sind in der Bestellung der Stammdatenänderung der Stammdatenänderung<BR align="left"/>Verwendungszeiträume der Daten mit dem Code „Erwartete Daten“ und / oder „Keine<BR align="left"/>Daten erwartet“ enthalten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A04" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A04</B><BR align="left"/><BR align="left"/><FONT>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein.<BR align="left"/>- Es wurden keine Stammdaten zur Änderung angegeben.<BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>50: </B>Kommt der Verantwortliche zu dem Ergebnis, dass er Änderungen an seinen<BR align="left"/>Stammdaten vornimmt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A05" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A05</B><BR align="left"/><BR align="left"/><FONT>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein.<BR align="left"/>- Änderungen an den Stammdaten werden vorgenommen.<BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "A06" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A06</B><BR align="left"/><BR align="left"/><FONT>Cluster: Änderung der Daten<BR align="left"/>Der Verantwortliche teilt in dem Bearbeitungsstand der Stammdaten mit:<BR align="left"/>- Die beim Berechtigten vorliegenden Daten stimmen mit den Daten des Verantwortlichen nicht überein.<BR align="left"/>- Änderungen an den Stammdaten werden nicht vorgenommen.<BR align="left"/>Eine Stammdatenänderung wird versendet.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "10" [color="#88a0d6"];
    "10" -> "20" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "40" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "A01" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "30" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "A02" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "A03" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "A04" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "50" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "A06" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
